{
  "part": "01",
  "pageRange": [1, 30],
  "originalText": "=== PART 01 ===\nTotal Pages: undefined\nExtracted: 2026-01-02T16:16:35.265Z\n\n=== EXTRACTED TEXT ===\n\n23\tThe OXI ONE MKII Manual\n► Expressive Mono Sequencer Phrase\n1. Ensure the synths are connected or for this example maybe connect\nto a DAW on a Mac or PC using MIDI. Set 3 tracks with instruments.\nTrack 1 and 2 pulse / pluck style sounds and track 3 a bass pad. Each\nof the following sequencers will connect to these DAW tracks. Hold\n[Shift] + hold [Clear] each sequencer 1,2,3.\n2. Set the project tempo. Hold [Shift] + turn (BPM) knob 1 to set to 120\nbeats per minute.\n3. Select sequencer 1 and set to Mono mode. Tap Seq [1]. Hold [Shift] +\n[1] to open the sequencer settings. Turn (Mode) to set the sequencer\nto 'MONO'. This is in page 1 of 3 for SEQ 1.\nI. Set scale and root. While holding [Shift] + turn (Scal) knob 3 and\n(Root) knob 4. Set to Minor C2. The octave range is set with (Oct)\nknob 2.\nII. Set the pattern length to 6 steps. Hold [End] + tap a pad in column\n6. Alternatively knob 3 will change end step while holding [End].\nThe Frst step, set with [Init], should by default be 1.\nIII. Add 3 steps as follows: Step 1 to C2, Step 3 to F2 and Step 5 to\nG2. To set these steps, columns represent steps, so use column\n1,3 and 5. Rows represent the notes. The display shows the notes\nwhen tapping a pad to set the step note. Pads assigned with\nnotes are lit.\nIV. Hold Step 3 [Pad] + tap [Page] to select the accumulator page.\nWhile holding Step 3 [Pad], turn knob 1 (Amt) and set to +1st.\nRepeat for Step 5, setting the accumulator (Amt) to -1st.\nV. Press [Play] to listen to the pattern created over the 6 step range.\n4. Copy sequence 1 to sequencer 2. Hold [Copy] + tap Seq [1] then hold\n[Paste] + tap Seq [2]. The sequencer will be copied. If this is\ncontrolling a different track in the DAW it may need to change channel\nto match the DAW track. Channel is set for the sequencer in its\nsettings, [Shift] + Seq [1], then turn (Ch) Knob 1.\n2.2 A Simple Expressive Sequence.\nWhile Mono is a simple sequencer mode on OXI ONE MKII it is still is packed with powerful features and is the\nperfect starting point. Here we build an expressive and playable sequence and demonstrate how quick it can be to\nget creative and be inspired by OXI ONE.\nLink to Oora's work?ow video here.\nWork?ow 2\nSEQ1 Setup 1/3\nCh\n1 A\nPC\nOFF\nOut\nALL\nMode\nMONO\n+\n+\n\n-- 1 of 30 --\n\n24 The OXI ONE MKII Manual\nLink to Oora's work?ow video here.\n► Expressive Mono Sequencer Phrase (Continued)\n5. Both sequencers play the same pattern. However pressing, [Perf] will\nopen the performance page. This allows each of the sequencers to be\ntransposed or rotated on the ?y allowing ad libs and performances to be\nplayed out. Row 1 represents sequencer 1 and row 2, sequencer 2. The\ncentral white column is the original state, i.e. no transposition. Press a\npad either side in these rows to transpose up or down.Hold [Shift] +\n[Pad] in row 1 and 2 to rotate patterns. Try these out and experiment\nwith the performer while the sequencer plays.\n6. Create a third mono mode seq on track 3. Follow the previous steps to\ncreate and conFgure the sequencer as a mono mode sequencer. Add a\nlong note for C2, bottom row. Hold Step 1 + tap step 16 to assign a tied\nnote.This will represent a long bass pad and should be set to the\nchannel for this track in the DAW.\n7. Lets add some variation with the ?ow button. Flow steps will only play\nwhile the ?ow button is held. Set steps 4 and 6 to notes G#2 and A#2\nrespectively. To dd these notes hold [Flow] + tap [Pad]. This assigns the\nsteps as only ?ow steps. When playing the sequence, hold [Flow] to\ntrigger these steps or release to play without these steps being triggered.\n8. Experiment once again in [Perf] mode to transpose sequencer patterns in\nharmony.\n9. Ensure the project is saved, hold [Shift] + tap [Save]. This will be a good\nstarting point from which to progress further.\nWork?ow\t2\n+\n\n-- 2 of 30 --\n\n25\tThe OXI ONE MKII Manual\nWork?ow 2\n► Building a Chord Pattern\n1. Start from the previous project.\n2. Select sequencer 4 and set to Chord mode. Tap Seq [4]. Hold [Shift] +\n[4] to open the sequencer settings. Turn (Mode) to set the sequencer\nto 'CHRD'. This is in page 1 of 3 for SEQ 4.\n3. Now to assemble some chords.\nI. In the main sequencer view, set scale and root. Hold [Shift] + turn\n(Scal) knob 3 and (Root) knob 4. Set to Minor C2. The octave\nrange is set with (Oct) knob 2.\nII. Press [Keyboard] to open the scale pads and chord selector.\nIII. Column 13 & 14 will select chord types, column 15, voicing /\ninversions and column 16 voice spread. The second top row in\nthe 16th column will selected between the chord banks.\nIV. Audition the chords to Fnd the ones to save. To store a chord,\nhold the pad keyboard for the chord and at the same time hold an\nempty, top row pad 1-12 for a few seconds. The pad will illuminate\nyellow when a chord is stored.\n4. The stored chords can now be used to sequence a melody. To pick\nand place a chord from sequencer view, hold [Keyboard] to show the\nchord view page and tap a stored chord pad 1-12 top row. Release\nthe [Keyboard] button and tap any step pad to place the selected\nchord on the grid. Repeat for other chords to build a melody.\n5. Now consider adding more interest and variation with some repeats.\nThe OXI ONE repeat engine offers a wide range of options to add\nrepeats, spread their intervals, add ramps and more. Hold a chord\nstep [Pad] + tap [Page] to select the step submenu for the repetition\nsettings. While still holding the pad, turn knob 1 (Rept) to set\nrepetitions.\n6. While still holding the step pad, try adjusting other parameters. Maybe\nset the repetition spacing with knob 4 and adjust the ramps with knob\n3. Experiment while playing the chords.\n2.3 Chords, Repetitions and Harmonization.\nChord mode allows a melody of chords to be selected from a library of scales, chords and voicing available and\npatterns to be build from these. Add ?ow steps to create variations and link the pattern to the previous project to\nplay all patterns in harmony.\nLink to Oora's work?ow video here.\nSEQ4 Setup 1/3\nCh\n4 A\nPC\nOFF\nOut\nALL\nMode\nCHRD\nStep Submenu\nRept\nOffst NteR\nDurat\nGlid Rpt%\nNo\n0%\n0%\t+- +-\n0st\nx 1\n0%\n0%\n100%\n\n-- 3 of 30 --\n\n26 The OXI ONE MKII Manual\nWork?ow\t2\nLink to Oora's work?ow video here.\n► Building a Chord Pattern (Continued)\n7. An alternative control for repetitions is to press (Rept), knob 4 from the\nmain sequencer screen. This will open the pad column editor for repeats.\nTap [Pad] to add repeats and [Shift] + [Pad] will adjust repeat duration,\nindicated by the red lit pads.\n8. To use ?ow to trigger only selected step repetitions, hold the step to edit\n[Pad] + tap knob 4. This switches focus to edit the lower Rept%\nparameter in the step submenu. With the pad still held, turn knob 4 to set\nRept% to 'Flow'. Now the repeats will only be applied when the [Flow]\nbutton is held.\n9. Let's link the chord sequencer playback to the mono sequencers\nplayback in an harmonious way. First, select sequencer [1]. Set the scale\nusing [Shift] + (Scal) knob 3 to 'HARMON S4'. This takes sequencer 1's\nharmonization lead from chord sequencer 4. Repeat for sequencer 2.\n10. Press [Perf] mode and experiment by transposing sequencer patterns.\nThese will now play and transpose in harmony. The mono sequencers 1\n& 2 will follow the harmonic lead of sequencer 4. Transposing the chord\nsequencer in the performer grid will control the chord and mono\nsequencers harmonization.\n11. Ensure the project is saved, hold [Shift] + tap [Save]. A good habit to get\ninto for saving iterative development of the project.\nMONO\n105.0\n1/16 HARMON S4 - C2\nPattern 3\n50% INT\tF\nVEL GATE\tOCT REPT\nCHRD\n105.0\n1/16 MINOR - C2\nPattern 3\n50% INT\tF\nVEL GATE\tOCT REPT\n\n-- 4 of 30 --\n\n27\tThe OXI ONE MKII Manual\nWork?ow 2\n► Building a Drum Pattern\n1. Start from the previous project.\n2. Select sequencer 5 and set to Multitrack mode. Tap Seq [5]. Hold\n[Shift] + [5] to open the sequencer settings. Turn (Mode) to set the\nsequencer to 'MULT'. This is in page 1 of 3 for SEQ 5.\n3. Destination instruments can be conFgured using one MIDI channel\nper drum, for example kick on channel 5. However some instruments\nwill respond to a single channel when each note represents a drum\ninstrument. For example, Elektron Digitakt can be used with an\nindividual note for each track. Both can be used in OXI ONE with a\nmultitrack sequencer.\n4. Setting up a multitrack track.\nI. To open the track menu, hold Sequencer [5] + Press Column 1\n[Pad] for the track to select. Alternatively, press [Track], then press\ncolumn 1 [Pad] to select a track.\nII. Turn (Ch) knob 1 to set the MIDI channel. This is for the selected\ntrack and not for the sequencer globally.\nIII. Hold [Shift] + tap [Keyboard] to set preview mode. Any sounds\ntriggered from the MIDI output will be audible.\nIV. Turn (Ofs) knob 2 to select a note offset. This is the note that the\nsteps on the track will trigger and send to the MIDI channel. The\nnote should represent the destination instrument, example 'C1'.\nV. Repeat for all tracks to conFgure.\n5. The behaviour when programming multitrack steps can be changed in\nthe [Shift] + [ConFg] > work?ow options. This depends on your\npersonal preference:\nTrack Select priority in multitrack.\n• Yes: First tap of a step will select the track to edit, then\nsubsequent step taps will assign triggers to the chosen step.\n• No: Trigger steps can be added immediately on any track when\ntapping a pad.\n2.4 Multitrack for Drums.\nMultitrack mode allows each row to act an independent sequencer. Individual MIDI channels can be set per row. If\nall sequencers were set to multitrack mode, OXI ONE would offer 64 tracks of sequencing. Lets create a drum\npattern using the multitrack sequencer.\nLink to Oora's work?ow video here.\nSEQ5 Setup[T:5] 1/3\nCh\n5 A\nT.PC\nOFF\nT.Out\nALL\nMode\nMULT\nTrack 4 Menu 1/2\nCh\n5 A\nDiv\n1/16\nOfs\nE1\nDir\n\n-- 5 of 30 --\n\n28 The OXI ONE MKII Manual\nWork?ow\t2\n5. Each track will represent a drum instrument, for example kick, snare,\nhi hat etc. Program steps on each track to create a drum pattern.\nPlaying the track will help to test sequence options.\n6. Each track is independent so lengths, time divisions and direction.\nAlso variations in the sound can also be applied. For example:-\n• Tap (Vel) knob 1 when in the main page to control velocity of the\nselected track using the grid pad column editor.\n• Tap (Rept) knob 4 when in the main page to assign repeats to\neach step of the selected track using the grid pad column editor.\n• Tap (Gate) knob 3 and then turn to adjust all gate lengths for the\nselected track.\n• Hold [Shift] + press [Flow] to open the groove editor for the\nselected track. Grooves can be also be applied per track.\n7. An alternative drum programming feature is the drum generator. This\nwill automatically generate patterns for the Frst three tracks of a\nmultitrack sequencer.\nI. The track layout will automatically generate a kick on track 1,\nsnare on track 2 and hats on track 3.\nII. Hold [Random] + tap column 1 [Pad] for track 1, 2 and 3. This\nchanges the status to drum generator tracks. Pads will be light\nbright blue when activated.\nIII. Set the track length to 32 steps. The drum generator is optimised\nfor this length. Press [32] then hold [End] + tap the last column\npad rows for the three tracks. Remember a multitrack can have\nthe length setting per track.\nIV. Press [Play] to generate patterns for these tracks.\n8. Try using [Perf] to manage the drum tracks on the ?y, using mutes\nand the preset variations to play ad libs and improvisations.\nPatterns\nDens\nOFF\nY\n64 0\nX\n0\nChaos\nC C# F#\tD# G# A#\tE\tD F G\ncv gate\nA B\n\n-- 6 of 30 --\n\n29\tThe OXI ONE MKII Manual\nWork?ow 2\n► Instrument De8nitions\n1. OXI ONE supports instrument deFnitions. What does this mean?\nSeveral proFles are loaded onto the device using the OXI App which\nact like MIDI presets. They provide the predeFned mapping between\nthe OXI ONE and the external device. This makes life easier where all\nCC controls are pre-conFgured and can simply be loaded to a track.\n2. As an example, create a 'POLY' track on say sequencer [6]. Follow\nthe previous guidance for MIDI and sequencer conFguration.\n3. To assign an instrument deFnition to seq 6, open the sequencer setup\nusing [Shift] + Sequencer [6]. Tap [Page] button to choose page 3/3\n4. Then turn (Instr) knob 3. The loaded deFnitions are listed. New\ndeFnitions can be added to the device from the app. As an example,\nchoose OXI Instruments Coral, a Eurorack effect module.\n5. Connect OXI ONE to the Coral device, in this example using the USB\nconnection option.\n6. Press [Mod] to view the mapped parameters for sequencer 6 and\nCoral device.\n► Modulation Lanes\n1. Track 6, for this example will focus on modulating another device. In\nthis case OXI Coral is the destination. It is assumed audio will be\nchannelled through Coral, maybe as generated in one of the other\nwork?ow examples.\n2. On sequencer 6, press [Mod]. This opens the modulation function with\n8 individual modulation lanes available. Think of these as modulation\nsequencers.\n3. If an instrument deFnition has been used the destinations are pre-\nmapped. If not [Shift] + [Mod] opens the modulation matrix settings.\n2.5 Magic of Modulation Lanes\nModulation is a term that refers to the control of a parameter to add movement and variation. For example a\nwhammy bar on a guitar modulates the strings. In electronic music modulation is typically applied through\nenvelopes and low frequency oscillators. This example focusses on a unique feature in OXI ONE, modulation\nlanes. These are track lanes dedicated to the modulation or external and internal parameters. Modulation is an\napplication and setup speciFc. Therefore this work?ow is only a general introduction to the principles of using\nmodulation lanes in OXI ONE.\nLink to Oora's work?ow video here.\nSEQ6 Setup 3/3\nnVoice\n7\nInstr\nCorl\n-\n-\nColor\n42\nSEQ6 Setup 1/3\nCh\n6 A\nPC\nOFF\nOut\nALL\nMode\nPOLY\nMOD-2 CC 2\nModW CC3\nCC5 CC7\nCC2 Expr\nCC6 CC8\nharm\ntimbre\nf.env \tf.reso\t8lter\nmorph\noct\n\tmidi\nnoise\nlevel \tpan\tspace\nsust\npart\noct\namp atk\natkdec\ntrig\namp dr\n8lter\namp\nmod atk\nharm\nMIDI\ncoral\ntimbre\nL\nmod dr\nmorph\nRout\nchorus\nfeq\n\n-- 7 of 30 --\n\n30 The OXI ONE MKII Manual\nWork?ow\t2\n4. In the mod page, the 4 knobs represent a lane. Tap and hold a knob\nto turn the modulation lane on or off. Tap a knob to switch the focus\nbetween the upper 1-4 and lower 5-8 lanes.\n5. Turning a knob, when active, will adjust all the step modulation\namount simultaneously. This is the value sent to the destination\nparameter from OXI ONE mod lane. Think of this as a set of steps,\neach adjusting the parameter value as the sequencer plays. Good\nexamples are a Flter cutoff, amount of reverb applied or the overall\ndry/wet mix of an effect.\n6. With a mod lane selected, the pads can be tapped to assign a value\nto each. Swiping across the pads to draw a modulation curve is\npossible. The grid pads act as column editors.\n7. To edit the modulation matrix for a speciFc lane, hold [Shift] + tap knob\nof the modulation lane to edit. A set of options for the CC destination\nas well as range settings are possible. Internal destinations can also\nbe applied.\n8. Try setting loops or different time divisions. Also include more than\none mod lane to modulate other device parameters in the same\nsequence but with independent shapes.\n9. To get even more advanced with modulation routing, it is possible to\nroute and external input, say a CV control from a Eurorack device,\nthrough OXI ONE and out to a MIDI destination. Experiment with\nroutings and controls in the [Shift] + [Mod] settings. This all depends\nof course on your hardware conFgurations and setups.\nMOD Lane 6\n\n-- 8 of 30 --\n\n31\tThe OXI ONE MKII Manual\nWork?ow 2\n\n-- 9 of 30 --\n\n32 The OXI ONE MKII Manual\n\n-- 10 of 30 --\n\n33\tThe OXI ONE MKII Manual\nSequencer Basics\n3\nOXI ONE is a battery powered performance orientated sequencer, controller\nand composition tool. Equally at home on the stage for live performances or in\nthe studio as a tool to help music production and sound design. ONE MKII is an\nevolution from the original model, Focusing heavily on evolving the sequencers,\nenhancing the work?ow and enhancing with new features. ONE has 8\nsequencers, each can be set to one of 6 unique sequencer modes. Whether\ncreating basic bass lines, intricate melodies or composing drum beats the right\ntools are in the ONE toolkit. The three most fundamental areas when working\nwith the sequencer are the user interface controls, the pad grid and the display\nscreen. Some controls are dynamic and change based on the context. For\nexample the 4 control rotary knobs will be assigned to parameters based on\nwhat function is selected and will display values to re?ect these parameters.\nThe grid is an important interface for creating patterns but is also used for\nediting parameters. The grid is multi purpose and will dynamically change its\nfunction to suit the sequencer mode and function selected. This section\nconcentrates the basics of using the ONE sequencers. The content here is\nFocused on the more generic views and commands than can be applied in most\nsequencing environments. These are foundation topics that need to be\nfamiliarised before moving to more advanced detail later. The unique intricacies\nor speciFc details of an individual sequencing mode is covered later.\n\n-- 11 of 30 --\n\n34 The OXI ONE MKII Manual\n3.1 What is a Sequencer?\nFrom the perspective of ONE, a sequencer manages, creates, and enables editing of tracks and patterns. The\nsequencer is the operating environment when building patterns from steps and controls the general sequence\nplayback and performance behavior. Only one sequencer can be selected at a time for editing and building tracks.\nThere are six sequencer operating modes. Each mode offers a set of options and work?ow tools that aim to Ft the\nspeciFc creative context. For example, mono mode is ideal for monophonic melodic or bass melodies.\nThe output created in the sequencer is typically a track. A track is a series of patterns, step events, and parameter\nsettings laid out over a musical timeline that controls the output to an external device. Typically, each sequencer\nwill manage a track, although there are exceptions for multitrack and matriceal mode, where the sequencer modes\ncan manage eight and four tracks respectively. It is helpful to think of a track as an instrument, although technically\nmultiple instruments can be connected to a ONE output. It is a standard practice to have one track represent each\nexternal instrument. For example, a poly synth controlled by a poly mode sequencer, a multitrack sequencer with a\nkick drum, snare and hat using three tracks, and a bass synth in mono mode could be a simple conFguration.\nSequencer Basics\t3\n8 available sequencer engines\nPattern Parameter Automation Lanes\nMode Seq Engine User Interface\nMaximum 16 Patterns / Sequencer\nTrack count based on mode\nInstrument\nSequencer\nTrack\n\n-- 12 of 30 --\n\n35\tThe OXI ONE MKII Manual\nSequencer Basics 3\n3.2 Navigating the Sequencers\nThe default home location upon start up is the sequencer view. A number of basic commands are generically\naccessible when working with the sequencers. Note that some controls are unique to the mode selected but\ntypically the following commands are generic.\nActive / Unmuted Inactive / Muted\nSelected\nDeselected\nSolid\nwhite\nSoft static\ncolor\nUnlit\nFlashes\nwhite / color\nSequencer View & Command Options\nSelecting a Sequencer\nActivating / Muting a Sequencer\nSequencer Status\nPress to select a sequencer to edit, tap [1] - [8]. Sequencer view allows patterns to be programmed\ninto the grid using the pads to assign steps. The grid pad color will re?ect the sequencer selected.\nIf the [Mute] button is latched on, pressing a sequencer will mute or unmute it. To select a sequencer\nwhile mute is latched on, hold [Shift] + tap [1] - [8].\nHold [Mute] + tap [1] - [8]. To mute or unmute one or more sequencers.\nTransport bar is stopped.\nHold [Mute] + tap any [Pad] in column 1 if the 16 x 8 grid. Muting / unmuting is applied\nimmediately when using this method. Transport playhead continues.\nWhen muting, holding [Mute] will delay the mute action for the chosen sequencer until the\n[Mute] button is released and then mute is activated immediately. The sequencer button will\n?ash red to signify that the sequencer is armed pending mute. (2)\nWhen unmuting, holding [Mute] will delay the unmute action for the chosen sequencer until\nthe [Mute] button is released and is then based on punch in/out quantization. The sequencer\nbutton will ?ash green to signify that the sequencer is armed pending unmute. (2)\nThe color of the sequencer buttons will indicate the current status\nof each sequencer. Only one sequencer can be selected at a time\nfor editing and viewing. The selected, active sequencer will ?ash in\ntime with the tempo BPM setting. (1)\nDefault grid pad colors per sequencer. These colors can be also\nbe optionally applied to the sequencer buttons. This option is\nselected in the conFg > work?ow settings.\nPurple\n0\nOrange\n56\nBlue\n14\nPink\n70\nMauve\n28\nTurquoise\n84\nYellow\n42\nAqua\n98\n+\n+\n(2) The default behavior is to mute the sequencer upon release of the mute button. The 'armed' mute state is indicated by the\nsequencer button color. The mute behavior can be changed in the conFg > performance settings.\n(1) The color scheme of the 1-8 sequencer pads can be selected in the conFg > work?ow menu options. The color of the 1-8 pad when\nit is selected will therefore be the based on the multi color or the default turquoise sequencer pad color scheme.\n\n-- 13 of 30 --\n\n36 The OXI ONE MKII Manual\nSequencer Basics\t3\n1\nOperates in mono, poly, chord and multitrack mode.\nTip. Use the alternate method below when muting column 1 steps.\nUsed in conjunction with the [Mute] button, column 1 is reserved for\nmuting the active sequencer, indicated by soft white grid pads.\nMuted step pads will be dimly lit purple and the note icon is displayed in the header of the step screen when muted.\n+\n+\nMute / Unmute a Step.\nHold [Mute] + tap [Pad]s.\nHold [Pad] + tap (Vel).\nMuting a Step\nAlternate option for muting. Use the velocity knob from within the\nstep parameter page which will be displayed while holding a pad.\nMO MT CH\tPO\n\n-- 14 of 30 --\n\n37\tThe OXI ONE MKII Manual\nSequencer Basics 3\nSequencer view presents the grid as a series of steps formatted to suit the mode selected. For example, mono\nmode will show each column as a sequential step left to right in time and each row as a note pitch value from\nwithin the chosen note scale. Some views of the grid also represent parameter control settings and these are\nspeciFc to the current operating context. Below are some generic structures and commands when using the grid\nfor sequencers.\nSteps - time / direction\nStart of visual range\nLower Notes\n \nHigher Notes\nEnd of visual range\nPitch based on scale\nTo adjust the grid note view range.\nVertical position\nTo adjust the steps in view.\nHorizontal position\nTap a page button to navigate step ranges 16, 32, 48, 64,\nbutton lit white. Double tap to access page ranges 80, 96,\n112, 128, button is lit blue. While playing, only the actively\nplaying page will be lit.\nSteps are organised across a series of 8 pages covering\nthe total 128 steps per sequencer presented as 16 steps\nfor each page on the pad grid.\nIf follower is active, the page viewed will automatically change to track the playhead position dynamically while playing. This\ncan be toggled on or off by, Holding [Shift] + [Track]. When follower is active a 'F' is displayed in the upper display. It is\nuseful to keep pages static while editing and when the sequencer is playing.\nTap knob 2, then turn ↑↓ Alternatively, hold [Track] + turn (Knob 1).\nTap [Track] to open track menu, [Shift] + turning (Knob 1) will\nadjust in octave increments.\nUp to 8 octaves can be navigated when scrolling through the grid rows vertically. Rows representing the start and end of an octave\nwill be illuminated when adjusting the octave view.\n+\n1-16\n65-80\n17-32\n81-96\n33-48\n97-112\n49-64\n113-128\nSequencer Grid View & Navigation\nOctave root note. Row soft white.\nActive notes, pads are lit in the\ncolor of the selected sequencer.\nUnlit, step has no notes.\nRed: Indicates that additional notes\nexist in lower octave.\nWhite: Indicates that additional\nnotes exist in upper octave.\nTied notes.\n2 1\nF\n\n-- 15 of 30 --\n\n38 The OXI ONE MKII Manual\nSequencer Basics\t3\n3.3 Navigating the Sequencer & Step Parameters\nThe ONE sequencers have parameters that cover the steps, tracks and the sequencer\nitself. Some parameters control the global values, affecting say, all steps, while others\nfocus on the individual function for example an individual step. These can be the same\nparameter but with a change in how it is applied.\nIn order to understand the overall parameter structure here is an introduction to\nnavigating the available options. Some parameters and pages will be the same across\nsequencer modes while some are unique to the speciFc sequencer mode and will be\ndetailed further in the mode description later.\nHighest level of conFguration for the overall sequencer including the conFguration of its\noperating mode such as mono, poly, chord etc. Generally represents multiple pages of\nglobal sequencer settings including MIDI channel, output port, program / bank change,\ninstrument deFnitions, color and more.\nGeneral track oriented settings including playback direction, time division and navigation\nthrough viewing the grid octave range. Most modes have one track but for modes such as\nmulti the track menu is important to manage the parameters for each of the 8 tracks.\nOpen the sequencer setup. Hold [Shift] + tap [1] - [8]. These are\nmode dependant but in general consist of several pages of\nparameters. Once the menu is open, selection can be changed to\nanother sequencer by pressing its button [1] - [8].\nOpen the track setup. Tap [Track] button.\nIf additional parameter pages exist, the [Page] button will ?ash.\nPress [Page] to cycle through available pages.\nAlso use [Shift] + sequencer button to cycle its pages.\nExamples: Mono Mode\nExample: Mono Mode\n+\nSEQ1 Setup 1/3\nCh\n1 A\nPC\nOFF\nOut\nALL\nMode\nMONO\nTrack Menu\n0\nDiv\nOFF\nDir Div\n1/16\nSEQ1 Setup 2/3\nIn\nGlob\nBnk\nOFF\nReset\nOFF\nTrnsp\nOFF\nSEQ1 Setup 3/3\n-\n-\nInstr\nNone\n-\n-\nColor\n20\nSequencer Setup.\nTrack Setup.\nParameters are edited with the respective knob. Some parameters will need to be conFrmed once\nedited by pressing the knob. These are shown with the down arrow symbol. Parameters that have\nbeen edited but the change has not been made active will be shown with a * symbol.\nNOTES\n\n-- 16 of 30 --\n\n39\tThe OXI ONE MKII Manual\nSequencer Basics 3\nNOTES\nWithin the displays that have a dual parameter row, tap the\nrespective parameter knob to switch between the upper and\nlower parameter for editing.\nStep setup typically falls into two sections. Firstly the global settings, applicable to all steps.\nSecondly the submenu options which apply to individual steps. Some generative modes\nare not edited on a step by step basis so there may be no step values visible.\nStep Global. Access to global step, extended parameters for the\nselected sequencer, tap [Step] button.\nStep Primary Parameters & Step Submenu. Access to the\nindividual parameters only for the selected step, hold [Step] button.\nIn some cases multiple steps held and can be edited together.\nCycle through the step primary and step submenu pages for the\nindividual step selected, hold [Step] + tap [Page] button.\nThe global options for primary parameters are found in the main\nsequencer view as the default parameters, controlled by knob 1-4.\nSecondary options, tempo, swing, scale and root are accessible by\nholding shift button.\n+\nD2 - Step 2\nVel\n75\nGate\n50\nOct\n+0\nTrig\n100%\nStep Submenu\nRept\nOffst Rng\nDurat\nGlid Rpt%\nNo\n0%\n0%\t+- +-\n0st\nx 1\n0%\n0%\n100%\nAccuml - Step 2\nAmt Acml+\nTotal %Mde\nMode Acml-\nTrig Acm%\n+0st\n+0st\n+7st\nlqnor\nWrap\nAll\n-0st\n100%\nStep Setup.\nSome parameters can be reset to default. To reset a parameter back to its default setting, press\nand hold the respective knob for >2 seconds while holding the pad.\nExample: Mono Mode - Global\nExample: Mono Mode - per Step\nStep/Accml Global\nRept\nOffst -\nDurat\nAcmM -\n...\n...\n...\t...\nStep\n...\n\n-- 17 of 30 --\n\n40 The OXI ONE MKII Manual\nSequencer Basics\t3\n3.4 Transport Controls\nTransport refers to the three play, stop and record controls. Be aware that these can be operated manually on the\npanel or may be in?uenced by external control, for example an external clock. The descriptions here are based on\ninternal synchronization.\nNote\nThe playback 'reset' option controls all sequencers. However, to reset individual sequencers, hold [Shift] + [Mute] + Sequencer [1] - [8] for the\nsequencer to reset. The reset behavior relies on the punch-in quantization.\nPlay / Pause Button Behavior Access settings by [Shift] + [ConFg] > Performance\nSetting Command Description\nOFF - Default Play Button will start playback from the Frst step. Any other press of play is ignored.\nButton ?ashes white and green\nPAUSE Play / Pause Button will start playback. Another press of play will pause playback or restart\nplayback from the paused position. Button ?ashes green while paused.\nRESET Play / Reset Button will start playback. Another press of the play button will reset playback of\nthe running sequencers to the start position once the punch-in quantization\ninterval is achieved. Punch in quantization is labelled as 'In' on page 2/3 of the\nsequencer setup pages.\nTo play the sequencers, press [Play]. The sequencers will start playing typically\nfrom the Frst step in the pattern unless conFgured differently. The play button\nbehavior can be reconFgured in the conFg > performance menu.\nRecording options are based on capturing incoming MIDI data into the sequencers or for selecting step recording on the\ngrid. The process of recording is explained elsewhere and in this section the basic commands are covered\nStopped\nGrey\nPlaying\nFlash green / white\nPlay Button\n+\nRecord. Press [Rec] to activate recording. This is used to record MIDI input or\nkeyboard view data. Press again to exit recording.\nStep Recording. To enter or exit step recording, hold [Rec] + press [Play]. The step\nrecording utility will be displayed which offers recording control using the knobs.\nArm Recording. To arm or disarm recording, hold [Rec] + press [Stop].\nArms recording pending a note input. Recording will start when a note is received.\nExit Recording. To enter or exit the recording settings, hold [Shift] + press [Rec].\nAlso press [Back] to exist the page.\nNot Recording\nGrey\nRecording\nRed\nStep Recording\nGrey\nArm Recording\nGrey\nStep Recording\nFlash red\nArm Recording\nTurquoise\nStep Recording\nFlash red\nRecord Button\n+\n+\n\n-- 18 of 30 --\n\n41\tThe OXI ONE MKII Manual\nSequencer Basics 3\nThe stop button will not only stop the sequencer but can also control the sequencer reset or synchronization.\nThe sequencer will display the status of the playback with the transport buttons but also with the white play head\ncursor. This will show the current steps played as it travels in the playback direction. Given that the pattern may\nextend beyond the 16 step default, follower option can be selected. This will automatically follow the playhead\nacross each page.\nNote\nWhen ONE is not set as the primary controller and with enabled in the conFg > MIDI settings, pressing the Play, Stop and Record buttons can output\na MIDI CC message on port A. These are Stop = CC 105, Play = CC 106 and Rec = CC 107.\nTo stop the sequencers, press [Stop]. The sequencers playhead will reset to the\nFrst step. When play is pressed it will start from this position.\nDouble tap to clear all MIDI, for example if there are hanging notes.\nTo reset the sequencers while playing, hold [Shift] + press [Stop]. This follows\nthe same punch-in quantization behavior as described above for the play\nbutton, although the play button conFguration setting is not relevant here.\nToggle follow function on or off by Holding [Shift] + tap [Track]. When on the\ngrid pages will change to follow the playhead. When off the pages will remain\nstatic, as selected. This is useful if editing on the ?y. Display will show a 'F'\nsymbol in the display header when on.\nClock Synchronization. With the sequencer stopped, the global clock\nsynchronization can be changed. Hold [Shift] + tap [Stop] to cycle through the\noptions of INT - Internal clock sync and external input options of USB, MIDI\nJack or Bluetooth or Clock input. The current setting is displayed and the last\nselected mode is the default when ONE is powered up.\nPlaying / Stopped\nGrey\nPlaying\nGrey\nStop Button\nFollower Option\n+\n+\n\n-- 19 of 30 --\n\n42 The OXI ONE MKII Manual\n3.5 Mute and Activation Behavior\nThe sequencer can be active, inactive, muted or unmuted. The behaviour of the mute button for this purpose can\nbe conFgured in the settings. An active / inactive sequencer refers to the entire sequencer transport. When\ninactive, transport will be stopped, no steps triggered and hence is also muted as there is no output. Only an\nactive, unmuted sequencer will issue control and note signals over the MIDI channel and physical outputs. Muting\nan active sequencer will still allow transport control but no control signals or notes are sent to the physical outputs.\nAlso check settings for other muting conFgurations.\nToggle on Release (Default ConFg) Activate / Deactivate\nAlternative Mute Sequencer & Mute Track Options (Default)\nMute on Release (ConFg Option) Mute / Unmute\nToggle Instant (ConFg Option) Activate / Deactivate\nMute Instant (ConFg Option) Mute / Unmute\nHold [Mute] + Tap [1] - [8]. To activate or deactivate one or more of the sequencers.\nThe action takes place only when the [Mute] button is released. While holding [Mute], the\nsequencers continue as normal, button ?ashes red to signify a pending deactivation.\nTransport playhead is then stopped. To reactivate mute will ?ash green pending activation.\nTransport restarts based on punch-in quantization.\nHold [Mute] + Tap [1] - [8]. To mute or unmute one or more of the sequencers.\nTransport playhead keeps running. Muting / unmuting takes place only when the [Mute]\nbutton is released. While holding [Mute], the sequencers continue as normal, button ?ashes\nred to signify a pending mute command and will ?ash green pending an unmute command.\nSequencers are still active, but all physical outputs are silenced.\nHold [Mute] + Tap [1] - [8]. To activate or deactivate one or more of the sequencers.\nTransport playhead is stopped. Muting / unmuting is applied immediately when pressing this\nbutton combination. When unmuted, transport restarts based on punch-in quantization.\nHold [Mute] + Tap [1] - [8]. To mute or unmute one or more of the sequencers.\nTransport playhead keeps running. Muting / unmuting is applied immediately when pressing\nthis button combination. Sequencers are still active, but all physical outputs are silenced.\nNormal\nNormal\nNormal\nNormal\nPending\nPending\nInactive\nMuted\nInactive\nMuted\nHold [Mute] + Tap any [Pad] in column 1 if the 16 x 8 grid. Transport playhead continues as\nnormal. This is an alternate way to mute and unmute a sequencer especially useful in multitrack\nmode where each track row can be muted / unmuting. This command is applied immediately when\npressing this button combination and does not adhere to the mute behavior described above.\nThe [Mute] button is used to control muting and activation of sequencers. This is usually held along\nwith the sequencer, step or track pads, however the mute button can be latched. Double tap [Mute]\nto latch the mute button on or to unlatch it off. Any subsequent commands while latched on, i.e.\nTapping Seq [1] - [8] will operate as if the mute button is held.\nThe mute behavior can be changed in the ConFg > Performance > Mute Behavior setting.\n+\n+\n+\n+\n+\nX 2\nSequencer Activate / Mute Control Options\nSequencer Basics\t3\nDefault\n\n-- 20 of 30 --\n\n43\tThe OXI ONE MKII Manual\nSequencer Basics 3\n3.6 Sequencing Steps\nIn most modes the programming of steps in a sequencer is performed by using the 16 x 8 grid pads. In some\nmodes and views the pads may also be used for applying parameter changes, however here we explain the\ngeneral process of programming steps on the grid. Note that the color scheme in view will depend on the\nsequencer selected. Ensure the desired sequencer is selected for editing.\nGrid represents 16 columns of steps and 8 rows of notes.\nThe view can be navigated by the page buttons and scrolling the octave ranges.\n+\n+\n+\n+\n+\nActivate or deactivate a step.\nQuickly tap [Pad]. (1)\n(4) Steps placed on the grid will adopt the current global parameter settings. Any edits to the global parameters will be automatically\napplied to all existing steps, the change applied is relative to its original value and the range of values will be displayed. Steps can\nbe edited individually by holding the step and adjusting the knob for the speciFc value.\nEdit an active step's parameters.\nHold active [Pad] + turn (Knob).\nEdit an inactive step's parameters.\nHold inactive [Pad] + turn (Knob).\nHold Pad] + [Page].\nHold\n1\n1\n2\n2\nTap\nTap\nHold\nTie multiple steps, same row.\nHold 1st [Pad] + tap last [Pad].\nTies all steps between the two pads (2).\nReverse tie, same row.\nHold last [Pad] + tap 1st [Pad]. (3)\nRandom or Fll sequence across the pads.\nCreating Steps\nEditing Step Parameters\nParameters are displayed in the home sequencer view (4).\nIncludes; velocity, octave, gate & trig, edited with knobs 1-4.\nTo change parameters before making a step active.\nUsed when conFg is set to not remove parameters when\nclearing steps. (1)\nAccess to an additional set of sub-menu and more advanced\nparameters. Also access using [Shift] + [Pad].\n(2) Steps can also be tied across pages. To tie steps, keep hold [Pad] on the Frst page, press the [Page] for the end location. While\nstill holding the Frst step, press [Pad] for the end of the tie on the new page. Ties must be made on the same row and octave. The\ntie setting is also available in the gate parameter values. When setting a tie using grid pads, ensure the pads are held / tapped in\nthe correct sequential order as stated in the command. Tapping a pad within a tie will split the tie and create a new step.\n(3) When applying the reverse tie, ie. Last + Frst pad, the steps will be populated between the two pads. The behavior of these steps is\nconFgured in the ConFg > Work?ow > Inverted TIE gesture Fills or Random setting. If set to 'Random', notes are populated as\nrandom values. If set to 'Fill' the equivalent note value is populated as a Fll in each step. This option can also be set to 'Off'.\n(1) When a step is deactivated the parameters that have been applied will be cleared. This is default behavior. This can be changed in\nthe conFg > work?ow settings to remember the parameter changes for a step when deactivated and to restore them back if the step\nis reactivated later. This is useful for preparing steps before making them active, especially when performing live.\nPads must be pressed in the order stated.\nPads must be pressed in the order stated.\nTied notes\nlit + soft white\nlit purple\nlit\nunlit\nRandom\nnotes\nReverse ties can be set to Off, Random or Fll. (3)\nAll lit\nMuted notes\nActive steps\nInactive step\n\n-- 21 of 30 --\n\n44 The OXI ONE MKII Manual\n3.7 Global Sequencer View Parameters\nIn sequencer view, a set of generic parameters that can be edited directly with the rotary encoder knobs. In\naddition the grid column pads can be used as a parameter editor for each option that is selected. The primary\nparameters can be adjusted globally for all steps or some can be edited at an individual step level when holding a\nstep pad. Secondary parameters mainly focus on global or sequencer settings.\nThe primary global setting will:-\n• Set the parameter value when subsequently laying down individual steps.\n• Adjust the value of any existing step values relative to their current value. If this is a multitrack, then all steps\non the selected track are affected. Individual step values can also be edited separately. Some other views and\nsequencer modes may change the default functions of these controls.\n1 3\t2 4\nTurn or Shift + turn\nto edit a value\nPrimary Parameter\nDirect access\nSecondary Parameter\nHold [Shift]\nTap\nto change editor\nTempo\nVelocity\nSwing\nOctave\nScale\nGate\nRoot\nRepeat\nAdjust Value\nPad Column\nVelocity Editor\nPad Column\nGate Editor\nPad Column\nRepeat/Retrigger Editor\nAdjust Value\tAdjust Value\nRange is Root -2 to Root +7\ne.g. C-2 to C7\nLower\nbased on the velocity of existing steps\nUpper\nNavigate View\nUp/Down (1)\nAdjust Value\nGlobal Controls\nOctave Parameter\nVelocity, Gate & Repeats Parameters\nMONO\n105.0\n1/16 CHROMATIC - C2\nPattern 3\n50% INT\tF\nVEL GATE\tOCT REPT\nGlobal Vel:\n75 - 100\nThe octave can be adjusted using the [Oct] knob. This is the base octave on the\ngrid for the selected sequencer and ranges from -2 to +7 based on the root\nselected. Edit root by holding shift and turning knob 4, (Root). The octave value\nof each step will be offset from this base octave.\nThe global values for velocity, gate and repeats are shown as a lower and upper\nrange. The values are based on the lowest and highest value from the steps\nalready placed on the grid. If no steps exist, the default is used for the upper and\nlower value. When editing these global values the existing step values will\nchange relative to the adjustment made. The value range will compress when\nadjusting at the upper and lower limits, also re?ected in each step value. For\nexample, the velocity upper limit is 127 and all steps will change to this value if\nediting the global velocity to the maximum level.\n(1) In a multitrack sequencer, tapping the octave knob will open the pitch editor.\nSequencer Basics\t3\n\n-- 22 of 30 --\n\n45\tThe OXI ONE MKII Manual\nSequencer Basics 3\nSequencer View Parameters\nParameter Label Command Range Description\nVelocity VEL (Knob 1) 1 - 127\nDefault 75\nControls the trig envelope amplitude for the output affecting the CV\nlevel. Global velocity sets a lower - upper range based on existing\nstep values to allow relative changes. Hold a step pad to edit the\nindividual step value. Tap for the step velocity grid column view to edit\nthe active velocity using the grid column pads for each step.\nOctave OCT (Knob 2) -4 to +4\nDefault C2\nThe global octave assigns a base octave range (not the note) for the\nsequencer grid notes. Individual step value can also be set as a\noctave value offset up or down from this global base octave. Tap to\ntoggle the knob to control scroll navigation up/down the grid or to reset\nback to the default view.\nGate GATE (Knob 3) 2 - 99, Tie\nor Legato\nDefault 50%\nSets the duration of the note with respect to the sequencer note\ndivision using the envelope decay time. The global option is set as\nlower - upper percentage range based on any existing step values in\norder to allow relative changes. Example, a 50% value for a note in a\n1/16th division pattern will last for half the time division, giving a 1/32\nnote length. Tap for step gate view and to edit the active step gate\nvalue using the grid column interface. Hold a step pad to edit an\nindividual step. Also applies a tie or legato setting.\nRepeat REPT (Knob 4) 1 - 15\nDefault 1\nTurn to adjust the lower - upper values for the repeat option. This will\nactivate a selected number of repeats at the note interval. This can be\nset between 1-15 repeats. The grid pad column view also gives\naccess to the retrigger option. Retrigger can activate between 1-8\nratchets within the note duration.\nTempo BPM [Shift] + (Knob 1) 20 - 300\nDefault 80\nSets the global beats per minute for all sequencers. This is used as\nthe internal clock but internal tempo is not used if an external clock is\nselected. Tap tempo can also be applied.\nSwing SWNG [Shift] + (Knob 2) 10 - 90\nDefault 50\nSwing introduces a more natural and slightly off grid feel to bring\ninterest to the rhythmic groove of a sequence. Increasing swing above\n50 will push some notes slightly late and lowering the swing below 50\npulls some notes slightly early. Default of 50 means no swing is\napplied. Each sequencer can have its own unique swing setting.\nScale SCAL [Shift] + (Knob 3) Options\nDefault\nChromatic\nSelects a scale for the sequencer. A library is available from which to\nchoose. The behavior of the scale function is also dependant on the\nscale quantization setting.\nRoot ROOT [Shift] + (Knob 4) C-2 to B7\nDefault C2\nSelects a root note for the sequencer. This is typically represented by\nthe bottom row of the grid in most modes.\nNote\nThe defaults for the velocity and gate setting are 75 and 50 respectively. These can be changed in the conFg > work?ow options.\n\n-- 23 of 30 --\n\n46 The OXI ONE MKII Manual\n3.8 Velocity\nVelocity represents how hard an instrument's note is played. Think of the effort applied\nwhen playing piano keys. Velocity is therefore considered modulation, and when\nsequencing, notes can be set to a global value or step value between 1-127. This can be\napplied to a destination instrument for example with MIDI to a synth or modulating\nanother target parameter with CV out to modular gear.\nVelocity can be edited using the encoder knob 1 globally or on a per step basis. The grid\npad column editor can also be used to change the velocity values. Default function for the\nknob is global velocity, turn to edit. For step velocity, hold a step and turn velocity and tap\nthe knob to open the respective pad column editor. Velocity affects the amplitude of the\nattack / decay output envelope.\nVelocity\n1\nVEL\nGrid Column Velocity Editor\nGlobal Velocity Editing\nStep Velocity Editing\nSteps - time / direction\tAffects the output envelope amplitude\n127\n5\n70\nVelocity Level\nOpen the grid column editor: Tap knob 1 (Vel). To temporarily view the editor, Hold knob 1 (Vel).\nTurn knob 1 (Vel).\nHold step [Pad] + turn knob 1 (Vel).\nNote that holding step and tapping knob 1 (Vel) will also mute or unmute the selected step.\n+\nTap a pad up or down the column to adjust the respective step's velocity level. Tapping an empty column,\ni.e. no step, will add a step at the velocity level selected. Steps can also be removed by tapping the\nbottom column pad to remove the step.\nChanging global velocity will alter the range dynamically across all existing pads relatively or set a value\nthat will be used for placing subsequent steps where the lower velocity value in the range is used.\nPlacing new steps will apply the current lower global value for the step velocity. Any changes to the\nglobal velocity will adjust all of the existing steps relatively. Editing the velocity for individual steps is also\npossible while holding the chosen step.\nGlobal Vel:\n75 - 100\nD2 - Step 2\nVel\n75\nGate\n50\nOct\n+0\nTrig\n100%\n1\n1\nSequencer Basics\t3\nNOTES\n\n-- 24 of 30 --\n\n47\tThe OXI ONE MKII Manual \nNOTES\nSequencer Basics 3\n3.9 Gate\nGate represents the duration that a note is played, controlled on a step basis or extending\nacross steps by tying a series of steps on the same row together. Legato creates a glide\nbetween steps. When sequencing, gate can be set to a global value or step value\nbetween 2-99. Consider the destination instrument settings in the overall note length for\nexample a synths on board envelopes.\nGate can be edited using the encoder knob 3 globally or on a per step basis. The grid\npad column editor can also be used to change the gate values. Default function for the\nknob is global gate, hold a step and turn for step gate and tap the knob to open the\nrespective pad column editor. Gate affects the decay of the attack / decay output\nenvelope.\nGrid Column Velocity Editor\nGlobal Gate Editing\nStep Gate Editing\nOpen the grid column editor: Tap knob 3 (Gate). To temporarily view the editor, Hold knob 3 (Gate).\nTurn knob 3 (Gate) slowly.\nTurn knob 3 (Gate) quickly clockwise to set a tie.\n[Pad] + Turn knob 3 (Gate) quickly clockwise to set a tie.\nTurn knob 3 (Gate) quickly counter-clockwise to break tie.\n[Pad] + Turn knob 3 (Gate) quickly counter-clockwise to break tie.\nHold step [Pad] + turn knob 3 (Gate) slowly.\nTap up or down the column to adjust the respective step's gate length. Tapping an empty column will add\na step at the gate level selected. Steps can also be removed by tapping the bottom column pad to\nremove the step. Tap a top row pad to select a tied step, the following columns set the tie duration.\nChanging global gate will alter the range dynamically across all existing pads relatively or set a value that\nwill be used for placing subsequent steps where the lower value in the gate range is used.\nPlacing new steps will apply the current lower global value for the step gate. Any changes to the global\ngate will adjust all of the existing steps relatively. Editing the velocity for individual steps is also possible\nwhile holding the chosen step. As well as a gate length and tie, a note can be set to LEG - Legato to\ncreate a seamless pitch glide between sequential notes.\nGlobal Gate:\n50 - 77\nD2 - Step 2\nVel\n75\nGate\n50\nOct\n+0\nTrig\n100%\n3\n3\nGate\n3\nGATE\nAffects the envelope decay time Steps - time / direction\n90\nTie\n5\n45\nGate Length\t\nTie\n\n-- 25 of 30 --\n\n48 The OXI ONE MKII Manual\n3.10 Repeat & Retrigger\nThe repeating of triggers during playback is a creative behavior option that can be applied in ONE and is controlled\nin two ways. Repeat can be set at a global and step level. This will replicate the playback of a triggered note at a\ndeFned number of iterations across a step duration. Assigning the 'skip' option to an individual step will ignore the\nstep timing, shortening the sequence.\nRetrigger is a variation on the repeat behavior typically controlled at global level to create a ratcheting effect over a\nstep interval. Retriggers can be transitioned to repeats in the extended step menu.\nGrid Column Repeat Editor\nGlobal Repeat & Retrigger Editing\nOpen the grid column editor:\nTap knob 4 (Rept).\nHold knob 4 (Rept) to temporarily view the editor.\nIn sequencer view, affects global repeats 1-15.\nIn the repeat grid column editor view, affects global retriggers 1-8.\nTurn knob 4 (Rept).\nTurn knob 4 (Rept).\n+ +\nIn the pad column editor, turn (Rept) Knob 4 to adjust the retrigger's or alternatively tap up or down the column to adjust the respective\nstep's retrigger. To adjust the repeats in the column editor view, hold [Shift] while adjusting Knob 4 or by tapping a column [Pad] for\nrepeats and [Shift] + [Pad] for repeat duration indicated by red pads.\nDirect adjustment of the repeat knob 4 will affect the number of repeats across all steps. Tapping knob 4 will switch to the retrig / repeat\ngrid column editor. Turning knob 4 directly affects repeats. A setting of 1 means no retrigger or repeats, just playback of the single\noriginal step.\nGlob Repeat:\n4 - 15\nGlobal Retrig:\n8 - 8\n4\n4\nRetrigger Both retrigger and repeats are displayed on the grid\nTime divisions e.g. 1/16th\nRetrigger example\nTime divisions e.g. 1/16th\nRepeat example\noriginal note original note\n4 retriggers 4 repeats\tretriggered note repeated note\nRepeat Repeat Duration\n4\t4\n4\nSequencer Basics\t3\nRETRIG\n(Shft) REPEAT\nDuration\nRepeats\nSteps - time / direction\n15\t8\n1\t1\n\n-- 26 of 30 --\n\n49\tThe OXI ONE MKII Manual\nSequencer Basics 3\nWhen working with individual steps a set of extended options exist which include more precise step repeat control.\nThis submenu can be found by holding the [Pad] + tapping [Page] to cycle through the extended page options.\nTap the respective knob to switch between editing the upper and lower parameters.\nKeep [Pad] held to edit the parameters using the four knobs.\n+\nStep Submenu\nRept\nOffst Rng\nDurat\nGlid Rpt%\nNo\n0%\n0%\t+- +-\n0st\nx 1\n0%\n0%\n100%\nStep Speci8c Repeat Control\nStep Repeat Parameters\nRept Durat Ramp Acceleration\nRepeats for the step Step Duration Repeat velocity ramp Repeat acceleration\nSet the number of step notes in\norder to create repeats. Set to\n'Off' or to a deFned number of\nrepeats 2-15 or to skip the step.\nSets the number of steps that\nthe repeat is extended over.\nApplies a ramp up 0 to +70% or\nramp down 0 to -70% of the\nvelocity across the repeats.\nApplies acceleration 0 to +28%\nor deceleration 0 to -28% of the\nthe repeat timing.\nOffst Glid Rng Rpt%\nTiming Offset Glide Randomized Note Range Repeat probability\nNote timing offset -45% to\n+45%, based on the time\ndivision of the grid.\nSets glide amount between\nrepeats to introduce a smooth\nnote transition. Only used for\nCV as MIDI doesn't support.\nSets a note range in which\nrandomised notes are applied.\nRange is 0 to 7st or +/-7st.\nProbability and logic conditions\nwhich activate repeat notes\nevents or not.\n\n-- 27 of 30 --\n\n50 The OXI ONE MKII Manual\nNOTES\nSequencer Basics\t3\nRepeats. The starting point would be a set number of\nrepeats, say 4 that cover the x1 step duration.\nRamp. The starting point would be a set number of\nrepeats, say 4 that cover the x8 step duration. The Y axis\nin this example refers to velocity level and this sets the\nramp amount.\nProbability % & Logic Conditions. A trigger condition parameter can also be set which determines if\nand when a repeat action is activated along with the step trigger, or not.\n+\n+\n-\n-\nDuration. The same retrigger count can be adjusted\nusing a duration covering a longer step length.\nExample shows 4 retriggers and x8 duration.\nAcceleration. The same repeat count can be adjusted\nusing duration over a longer step length. Example shows\n6 repeats and x8 duration.\nThe 'Rept' parameter sets the amount of repeats that will be applied in the step period. This starts at a\nmaximum of 8 at x1 duration but expands up to 15 when the duration value is increased. The length of\nthe repeat chain can be extended over a duration covering multiple steps. This is set using the 'Durat'\nparameter with options ranging from x1 to x15 steps.\nThe option to change the repeat behavior is also possible by ramping up or down the velocity of the\nrepeats, set over a +/-70% range. Here less is more, so try smaller values Frst. In addition the repeat\nintervals can be accelerated or decelerated from the initial step and over a +/-28 range.\nRepeats & Duration\nVelocity Ramp, Acceleration and Probability\noriginal note\tExamples\nExamples\nrepeated note 1/16th notes\n\n-- 28 of 30 --\n\n51\tThe OXI ONE MKII Manual\nSequencer Basics 3\n4\n3.11 Trigger Probability\nTrigger probability, labelled 'Trig' in the step parameters, is only available at a per step level. Holding one or more\nsteps will allow the trig parameter to be edited using knob 4 for these steps. One trig condition is set per step. Trig\nvalue is evaluated on each cycle of the sequencer, commencing from pressing play and then sets whether the\nstep will be triggered or not. The same model is applied for the repeats engine and any other probability functions.\nKnob 4 will set the global repeat by default and revert to step triggers while holding one or more steps.\nTrig can be assigned a probability % value which sets how likely it is for a step to\ntrigger or not. Default is 100% meaning a step will trigger on each sequence cycle as\nnormal and 0% will never trigger. Anything in-between will trigger in a random style\nfrequency based on the %. For example, 50% doesn't trigger predictably, once every\nother cycle, but generally it will trigger 50% of the time on average.\nThe logical options offer a predictable application variation into a pattern when\ntriggering notes on sequencer count cycles. The A represents the number of the cycle\nthat will trigger the step. The count is reset after sequencer completes cycle number B.\nHold step [Pad] + turn knob 4 (Trig).\nHold step [Pad] + Push / hold knob 4 (Trig).\tReset the trig value to\neither 100% or Fixed lock\n0% 50% 100%\nnever\ntrigger\nOptions: 1:2, 2:2, 1:3, 2:3, 3:3, 1:4,\n2:4, 3:4, 4:4, 1:5, 2:5, 3:5, 4:5, 5:5,\n1:6, 2:6, 3:6, 4:6, 5:6, 6:6, 1:7, 2:7,\n3:7, 4:7, 5:7, 6:7, 7:7, 1:8, 2:8, 3:8,\n4:8, 5:8, 6:8, 7:8, 8:8\n50/50\nchance\nalways\ntrigger\n+\n+\nD2 - Step 2\nVel\n75\nGate\n50\nOct\n+0\nTrig\n100%\n4\nProbability %\nA:B Logic Condition\nExamples:\nExample: 2:4\nTrigger on the 2nd cycle of a 4 count. Reset at the end of 4th cycle.\nThe pattern will trigger overall on every 2nd, 6th, 10th and so forth.\n1:2\nTrigger is active on Frst loop, not the second.\nThe count resets after the second loop and\nthis on/off trigger cycle pattern continues.\n3:4\nTrigger is active on third loop and the count\nresets after the fourth. The pattern will trigger\noverall on every 3rd, 7th, 11th etc.\nStep 5 Trig\nCycle 1\nCycle 2\nCycle 3\nCycle 4\nCount Reset\nTrig Condition is True False\n\n-- 29 of 30 --\n\n52 The OXI ONE MKII Manual\nNOTES\nSequencer Basics\t3\nSimilar principles as the A:B model but follows a logical 'not'\ncondition. The A represents the number of the cycle that will\nNOT trigger the step. All other cycles will trigger the step. The\ncount is reset after sequencer completes cycle number B.\nPRE activates this trig on the chosen step only when the nearest prior step condition is true. This check\nrefers to the previous, most recent trigger condition state and is not based purely on whether the prior step\nitself is active or not but it depends on its trigger state. This step will not trigger if the prior trigger condition\nis not met i.e. 'false'. If set to 'Not Pre' i.e. PRE, the step will trigger if the prior trigger condition is 'false'.\nPRE / PRE Logic Condition\nOptions: 1:2, 2:2, 1:3, 2:3, 3:3, 1:4,\n2:4, 3:4, 4:4, 1:5, 2:5, 3:5, 4:5, 5:5,\n1:6, 2:6, 3:6, 4:6, 5:6, 6:6, 1:7, 2:7,\n3:7, 4:7, 5:7, 6:7, 7:7, 1:8, 2:8, 3:8,\n4:8, 5:8, 6:8, 7:8, 8:8\nA:B Logic Condition\nExamples:\nExamples:\nExample: 2:4\nTrigger on all cycles of a 4 count except the 2nd cycle. Reset at the end of\n4th cycle. The pattern will trigger overall on every 1st, 3rd, 4th and so on.\n1:2\nTrigger is inactive on Frst loop, active\non the second. The count resets after\nthe second loop and this on/off trigger\ncycle pattern continues.\n3:4\nTrigger is inactive on third loop and\nthe count resets after the fourth. The\npattern will effectively trigger overall\non every 1st, 2nd, 4th etc.\nStep 5 Trig\nCycle 1\nCycle 2\nCycle 3\nCycle 4\nTrig Condition is True False\nStep 13 set to Trig = PRE\nStep 13 set to Trig = PRE\nStep 13 will trigger\nStep 13 will not trigger\nStep 10 = True, i.e. 100%\nStep 10 = False, i.e. 0%\nStep 13 will not trigger\nStep 13 will trigger\nStep 10 = True, i.e. 100%\nStep 10 = False, i.e. 0%\nCount Reset\n\n-- 30 of 30 --\n",
  "translation": "22 The OXI ONE MKII Manual\n► 表現力豊かなMonoシーケンサーフレーズ\n1. シンセが接続されていることを確認します。この例ではMacまたはPC上のDAWにMIDIで接続することもできます。3つのトラックに音源を設定します。トラック1と2はパルス/プラック系のサウンド、トラック3はベースパッドを使用します。以下の各シーケンサーがこれらのDAWトラックに接続されます。[Shift]を押しながら[Clear]を押したまま、シーケンサー1、2、3をそれぞれクリアします。\n2. プロジェクトのテンポを設定します。[Shift]を押しながら(BPM)ノブ1を回して120 BPMに設定します。\n3. シーケンサー1を選択してMonoモードに設定します。Seq [1]をタップします。[Shift] + [1]を押してシーケンサー設定を開きます。(Mode)を回してシーケンサーを'MONO'に設定します。これはSEQ 1のページ1/3にあります。\nI. スケールとルートを設定します。[Shift]を押しながら(Scal)ノブ3と(Root)ノブ4を回します。Minor C2に設定します。オクターブ範囲は(Oct)ノブ2で設定します。\nII. パターン長を6ステップに設定します。[End]を押しながら6列目のパッドをタップします。または、[End]を押しながらノブ3で終了ステップを変更することもできます。[Init]で設定される最初のステップは、デフォルトで1になっているはずです。\nIII. 次のように3つのステップを追加します:ステップ1をC2、ステップ3をF2、ステップ5をG2に設定します。これらのステップを設定するには、列がステップを表すので、列1、3、5を使用します。行は音符を表します。パッドをタップしてステップノートを設定すると、ディスプレイに音符が表示されます。音符が割り当てられたパッドは点灯します。\nIV. ステップ3の[Pad]を押しながら[Page]をタップしてアキュムレーターページを選択します。ステップ3の[Pad]を押しながらノブ1 (Amt)を回して+1stに設定します。ステップ5についても同様に繰り返し、アキュムレーター(Amt)を-1stに設定します。\nV. [Play]を押して、6ステップ範囲で作成されたパターンを聴きます。\n4. シーケンス1をシーケンサー2にコピーします。[Copy]を押しながらSeq [1]をタップし、次に[Paste]を押しながらSeq [2]をタップします。シーケンサーがコピーされます。これがDAWの別のトラックを制御している場合は、DAWトラックに合わせてチャンネルを変更する必要があるかもしれません。チャンネルはシーケンサー設定で設定します。[Shift] + Seq [1]を押してから(Ch)ノブ1を回します。\n\n2.2 シンプルで表現力豊かなシーケンス。\nMonoはOXI ONE MKIIのシンプルなシーケンサーモードですが、強力な機能が満載されており、完璧な出発点です。ここでは表現力豊かで演奏可能なシーケンスを構築し、OXI ONEでどれだけ素早くクリエイティブになり、インスピレーションを得られるかをデモンストレーションします。\n\nLink to Oora's workflow video here.\n\nワークフロー 2\n\nSEQ1 Setup 1/3\nCh 1 A\nPC OFF\nOut ALL\nMode MONO\n\n-- 1 of 30 --\n\n23 The OXI ONE MKII Manual\n\nLink to Oora's workflow video here.\n\n► 表現力豊かなMonoシーケンサーフレーズ(続き)\n5. 両方のシーケンサーは同じパターンを再生します。しかし、[Perf]を押すとパフォーマンスページが開きます。これにより、各シーケンサーをその場でトランスポーズまたはローテートでき、アドリブやパフォーマンスを演奏できます。行1がシーケンサー1を、行2がシーケンサー2を表します。中央の白い列が元の状態、つまりトランスポーズなしです。これらの行のどちらかのパッドを押すと、上下にトランスポーズします。[Shift] + [Pad]を行1と2で押してパターンをローテートします。シーケンサーの再生中にパフォーマーを試して実験してみてください。\n6. トラック3に3番目のmonoモードシーケンサーを作成します。前のステップに従って、シーケンサーをmonoモードシーケンサーとして作成・設定します。C2の長い音符を追加します(最下行)。ステップ1を押しながらステップ16をタップしてタイドノートを割り当てます。これは長いベースパッドを表し、DAWのこのトラックのチャンネルに設定する必要があります。\n7. フローボタンでバリエーションを追加しましょう。フローステップは、フローボタンが押されている間のみ再生されます。ステップ4と6を音符G#2とA#2にそれぞれ設定します。これらの音符を追加するには[Flow]を押しながら[Pad]をタップします。これによりステップがフローステップのみとして割り当てられます。シーケンスの再生中に[Flow]を押してこれらのステップをトリガーするか、離して これらのステップがトリガーされずに再生します。\n8. [Perf]モードで再度実験して、シーケンサーパターンをハーモニーでトランスポーズします。\n9. プロジェクトが保存されていることを確認します。[Shift]を押しながら[Save]をタップします。これはさらに進めるための良い出発点になります。\n\nワークフロー 2\n\n-- 2 of 30 --\n\n24 The OXI ONE MKII Manual\n\nワークフロー 2\n\n► コードパターンの構築\n1. 前のプロジェクトから開始します。\n2. シーケンサー4を選択してChordモードに設定します。Seq [4]をタップします。[Shift] + [4]を押してシーケンサー設定を開きます。(Mode)を回してシーケンサーを'CHRD'に設定します。これはSEQ 4のページ1/3にあります。\n3. それではコードを組み立てましょう。\nI. メインシーケンサービューで、スケールとルートを設定します。[Shift]を押しながら(Scal)ノブ3と(Root)ノブ4を回します。Minor C2に設定します。オクターブ範囲は(Oct)ノブ2で設定します。\nII. [Keyboard]を押してスケールパッドとコードセレクターを開きます。\nIII. 列13と14でコードタイプを選択し、列15でボイシング/インバージョン、列16でボイススプレッドを選択します。16列目の上から2番目の行でコードバンク間を選択します。\nIV. コードをオーディションして保存するものを見つけます。コードを保存するには、コードのパッドキーボードを押しながら、同時に空の上段パッド1-12を数秒間押します。コードが保存されるとパッドが黄色に点灯します。\n4. 保存されたコードを使用してメロディをシーケンスできるようになりました。シーケンサービューからコードを選択して配置するには、[Keyboard]を押したままコードビューページを表示し、保存されたコードパッド1-12の上段をタップします。[Keyboard]ボタンを離してステップパッドをタップし、選択したコードをグリッドに配置します。他のコードについても繰り返してメロディを構築します。\n5. 次に、リピートでさらに面白さとバリエーションを追加することを検討します。OXI ONEリピートエンジンは、リピートを追加し、間隔を広げ、ランプを追加するなど、幅広いオプションを提供します。コードステップ[Pad]を押しながら[Page]をタップして、リピート設定のステップサブメニューを選択します。パッドを押したまま、ノブ1 (Rept)を回してリピート回数を設定します。\n6. ステップパッドを押したまま、他のパラメータを調整してみてください。ノブ4でリピート間隔を設定し、ノブ3でランプを調整することもできます。コードを再生しながら実験してみてください。\n\n2.3 コード、リピート、ハーモナイゼーション。\nChordモードでは、利用可能なスケール、コード、ボイシングのライブラリからコードのメロディを選択し、それらからパターンを構築できます。フローステップを追加してバリエーションを作成し、パターンを前のプロジェクトにリンクして、すべてのパターンをハーモニーで再生します。\n\nLink to Oora's workflow video here.\n\nSEQ4 Setup 1/3\nCh 4 A\nPC OFF\nOut ALL\nMode CHRD\n\nStep Submenu\nRept\nOffst NteR Durat\nGlid Rpt%\nNo 0% 0% +- +- 0st x 1 0% 0% 100%\n\n-- 3 of 30 --\n\n25 The OXI ONE MKII Manual\n\nワークフロー 2\n\nLink to Oora's workflow video here.\n\n► コードパターンの構築(続き)\n7. リピートの別のコントロール方法は、メインシーケンサー画面から(Rept)、ノブ4を押すことです。これによりリピート用のパッド列エディターが開きます。[Pad]をタップしてリピートを追加し、[Shift] + [Pad]で赤く点灯したパッドで示されるリピートデュレーションを調整します。\n8. フローを使用して選択したステップリピートのみをトリガーするには、編集するステップ[Pad]を押しながらノブ4をタップします。これにより、ステップサブメニューの下のRept%パラメータに編集フォーカスが切り替わります。パッドを押したまま、ノブ4を回してRept%を'Flow'に設定します。これで[Flow]ボタンを押している間のみリピートが適用されます。\n9. コードシーケンサーの再生をmonoシーケンサーの再生にハーモニアスな方法でリンクしましょう。まず、シーケンサー[1]を選択します。[Shift] + (Scal)ノブ3を使用してスケールを'HARMON S4'に設定します。これによりシーケンサー1のハーモナイゼーションがコードシーケンサー4から導かれます。シーケンサー2についても繰り返します。\n10. [Perf]モードを押して、シーケンサーパターンをトランスポーズして実験します。これらはハーモニーで再生およびトランスポーズされます。monoシーケンサー1と2はシーケンサー4のハーモニックリードに従います。パフォーマーグリッドでコードシーケンサーをトランスポーズすると、コードとmonoシーケンサーのハーモナイゼーションが制御されます。\n11. プロジェクトが保存されていることを確認します。[Shift]を押しながら[Save]をタップします。プロジェクトの反復的な開発のために保存する良い習慣です。\n\nMONO\n105.0\n1/16 HARMON S4 - C2\nPattern 3\n50% INT F\nVEL GATE OCT REPT\n\nCHRD\n105.0\n1/16 MINOR - C2\nPattern 3\n50% INT F\nVEL GATE OCT REPT\n\n-- 4 of 30 --\n\n26 The OXI ONE MKII Manual\n\nワークフロー 2\n\n► ドラムパターンの構築\n1. 前のプロジェクトから開始します。\n2. シーケンサー5を選択してMultitrackモードに設定します。Seq [5]をタップします。[Shift] + [5]を押してシーケンサー設定を開きます。(Mode)を回してシーケンサーを'MULT'に設定します。これはSEQ 5のページ1/3にあります。\n3. デスティネーション音源は、ドラムごとに1つのMIDIチャンネルを使用して設定できます。たとえばキックをチャンネル5に設定します。ただし、一部の音源は各音符がドラム音源を表す場合、単一のチャンネルに応答します。たとえば、Elektron Digitaktは各トラックに個別の音符を使用できます。どちらもOXI ONEのmultitrackシーケンサーで使用できます。\n4. multitrackトラックの設定。\nI. トラックメニューを開くには、シーケンサー[5]を押しながら選択するトラックの列1の[Pad]を押します。または、[Track]を押してから列1の[Pad]を押してトラックを選択します。\nII. (Ch)ノブ1を回してMIDIチャンネルを設定します。これは選択したトラック用であり、シーケンサー全体用ではありません。\nIII. [Shift]を押しながら[Keyboard]をタップしてプレビューモードを設定します。MIDI出力からトリガーされるサウンドが聞こえるようになります。\nIV. (Ofs)ノブ2を回してノートオフセットを選択します。これはトラック上のステップがトリガーしてMIDIチャンネルに送信する音符です。音符はデスティネーション音源を表す必要があります。例:'C1'。\nV. すべてのトラックについて繰り返して設定します。\n5. multitrackステップをプログラミングする際の動作は、[Shift] + [Config] > ワークフローオプションで変更できます。これは個人の好みによります:\nMultitrackでのトラック選択優先度。\n• Yes:ステップの最初のタップで編集するトラックが選択され、その後のステップタップで選択したステップにトリガーが割り当てられます。\n• No:パッドをタップすると、任意のトラックのトリガーステップを即座に追加できます。\n\n2.4 ドラム用のMultitrack。\nMultitrackモードでは、各行が独立したシーケンサーとして機能します。行ごとに個別のMIDIチャンネルを設定できます。すべてのシーケンサーをmultitrackモードに設定すると、OXI ONEは64トラックのシーケンスを提供します。multitrackシーケンサーを使用してドラムパターンを作成しましょう。\n\nLink to Oora's workflow video here.\n\nSEQ5 Setup[T:5] 1/3\nCh 5 A\nT.PC OFF\nT.Out ALL\nMode MULT\n\nTrack 4 Menu 1/2\nCh 5 A\nDiv 1/16\nOfs E1\nDir\n\n-- 5 of 30 --\n\n27 The OXI ONE MKII Manual\n\nワークフロー 2\n\n5. 各トラックはドラム音源、たとえばキック、スネア、ハイハットなどを表します。各トラックにステップをプログラムしてドラムパターンを作成します。トラックを再生すると、シーケンスオプションをテストするのに役立ちます。\n6. 各トラックは独立しているため、長さ、タイムディビジョン、方向が異なります。また、サウンドのバリエーションも適用できます。例えば:\n• メインページで(Vel)ノブ1をタップして、グリッドパッド列エディターを使用して選択したトラックのベロシティを制御します。\n• メインページで(Rept)ノブ4をタップして、グリッドパッド列エディターを使用して選択したトラックの各ステップにリピートを割り当てます。\n• (Gate)ノブ3をタップしてから回して、選択したトラックのすべてのゲート長を調整します。\n• [Shift]を押しながら[Flow]を押して、選択したトラックのグルーブエディターを開きます。グルーブはトラックごとにも適用できます。\n7. 別のドラムプログラミング機能はドラムジェネレーターです。これにより、multitrackシーケンサーの最初の3つのトラックのパターンが自動的に生成されます。\nI. トラックレイアウトは、トラック1にキック、トラック2にスネア、トラック3にハットを自動的に生成します。\nII. [Random]を押しながらトラック1、2、3の列1の[Pad]をタップします。これによりステータスがドラムジェネレータートラックに変更されます。アクティブ化すると、パッドが明るい青色に点灯します。\nIII. トラック長を32ステップに設定します。ドラムジェネレーターはこの長さに最適化されています。[32]を押してから[End]を押しながら3つのトラックの最後の列パッド行をタップします。multitrackはトラックごとに長さ設定を持つことができることを忘れないでください。\nIV. [Play]を押してこれらのトラックのパターンを生成します。\n8. [Perf]を使用してその場でドラムトラックを管理し、ミュートとプリセットバリエーションを使用してアドリブとインプロビゼーションを演奏してみてください。\n\nPatterns\nDens OFF\nY 64 0\nX 0\nChaos\nC C# F# D# G# A# E D F G\ncv gate\nA B\n\n-- 6 of 30 --\n\n28 The OXI ONE MKII Manual\n\nワークフロー 2\n\n► 音源定義\n1. OXI ONEは音源定義をサポートしています。これはどういう意味でしょうか?OXI Appを使用していくつかのプロファイルがデバイスにロードされ、MIDIプリセットのように機能します。これらはOXI ONEと外部デバイス間の事前定義されたマッピングを提供します。これにより、すべてのCCコントロールが事前設定され、トラックに簡単にロードできるため、作業が簡単になります。\n2. 例として、シーケンサー[6]に'POLY'トラックを作成します。MIDIとシーケンサー設定については、前のガイダンスに従ってください。\n3. seq 6に音源定義を割り当てるには、[Shift] + シーケンサー[6]を使用してシーケンサーセットアップを開きます。[Page]ボタンをタップしてページ3/3を選択します。\n4. 次に(Instr)ノブ3を回します。ロードされた定義がリストされます。新しい定義はアプリからデバイスに追加できます。例として、EurorackエフェクトモジュールであるOXI Instruments Coralを選択します。\n5. OXI ONEをCoralデバイスに接続します。この例ではUSB接続オプションを使用します。\n6. [Mod]を押して、シーケンサー6とCoralデバイス用のマップされたパラメータを表示します。\n\n► モジュレーションレーン\n1. この例のトラック6は、別のデバイスのモジュレーションに焦点を当てます。この場合、デスティネーションはOXI Coralです。オーディオはCoralを通して送られることが想定されています。他のワークフロー例で生成されたものなどです。\n2. シーケンサー6で[Mod]を押します。これにより、8つの個別のモジュレーションレーンが利用可能なモジュレーション機能が開きます。これらをモジュレーションシーケンサーと考えてください。\n3. 音源定義が使用されている場合、デスティネーションは事前にマップされています。そうでない場合、[Shift] + [Mod]でモジュレーションマトリックス設定が開きます。\n\n2.5 モジュレーションレーンの魔法\nモジュレーションとは、動きとバリエーションを追加するためのパラメータの制御を指す用語です。たとえば、ギターのワーミーバーは弦をモジュレートします。電子音楽では、モジュレーションは通常、エンベロープとローフリケンシーオシレーターを通して適用されます。この例は、OXI ONEのユニークな機能であるモジュレーションレーンに焦点を当てています。これらは外部および内部パラメータのモジュレーションに専用のトラックレーンです。モジュレーションはアプリケーションとセットアップに固有です。したがって、このワークフローはOXI ONEでモジュレーションレーンを使用する原則の一般的な紹介にすぎません。\n\nLink to Oora's workflow video here.\n\nSEQ6 Setup 3/3\nnVoice 7\nInstr Corl\n- -\nColor 42\n\nSEQ6 Setup 1/3\nCh 6 A\nPC OFF\nOut ALL\nMode POLY\n\nMOD-2 CC 2\nModW CC3\nCC5 CC7\nCC2 Expr\nCC6 CC8\nharm timbre\nf.env f.reso filter\nmorph oct midi\nnoise level pan space\nsust part oct\namp atk atkdec trig\namp dr filter amp\nmod atk harm\nMIDI coral timbre L\nmod dr morph Rout\nchorus feq\n\n-- 7 of 30 --\n\n29 The OXI ONE MKII Manual\n\nワークフロー 2\n\n4. modページでは、4つのノブがレーンを表します。ノブをタップして押したままにすると、モジュレーションレーンのオン/オフが切り替わります。ノブをタップすると、上段1-4と下段5-8のレーン間でフォーカスが切り替わります。\n5. アクティブな状態でノブを回すと、すべてのステップモジュレーション量が同時に調整されます。これはOXI ONE modレーンからデスティネーションパラメータに送信される値です。これを一連のステップと考えてください。各ステップがシーケンサーの再生に合わせてパラメータ値を調整します。良い例は、フィルターカットオフ、適用されるリバーブ量、またはエフェクトの全体的なドライ/ウェットミックスです。\n6. modレーンが選択されている状態で、パッドをタップして各ステップに値を割り当てることができます。パッドをスワイプしてモジュレーションカーブを描くことも可能です。グリッドパッドは列エディターとして機能します。\n7. 特定のレーンのモジュレーションマトリックスを編集するには、[Shift]を押しながら編集するモジュレーションレーンのノブをタップします。CCデスティネーションのオプションセットと範囲設定が可能です。内部デスティネーションも適用できます。\n8. ループや異なるタイムディビジョンを設定してみてください。また、同じシーケンス内で他のデバイスパラメータをモジュレートするために、独立したシェイプを持つ複数のmodレーンを含めます。\n9. モジュレーションルーティングでさらに高度になるには、外部入力、たとえばEurorackデバイスからのCVコントロールをOXI ONEを通してMIDIデスティネーションに送ることが可能です。[Shift] + [Mod]設定でルーティングとコントロールを実験してください。これはもちろん、ハードウェア設定とセットアップによって異なります。\n\nMOD Lane 6\n\n-- 8 of 30 --\n\n30 The OXI ONE MKII Manual\n\nワークフロー 2\n\n-- 9 of 30 --\n\n31 The OXI ONE MKII Manual\n\n-- 10 of 30 --\n\n32 The OXI ONE MKII Manual\n\nシーケンサーの基本\n3\n\nOXI ONEは、バッテリー駆動のパフォーマンス指向のシーケンサー、コントローラー、作曲ツールです。ライブパフォーマンスのステージでも、音楽制作やサウンドデザインを支援するスタジオツールとしても、同様に活躍します。ONE MKIIはオリジナルモデルからの進化版で、シーケンサーの進化、ワークフローの強化、新機能の追加に重点を置いています。ONEには8つのシーケンサーがあり、それぞれ6つのユニークなシーケンサーモードのいずれかに設定できます。基本的なベースライン、複雑なメロディ、ドラムビートの作曲など、ONEツールキットには適切なツールが揃っています。シーケンサーを操作する際の3つの最も基本的な領域は、ユーザーインターフェースコントロール、パッドグリッド、ディスプレイ画面です。一部のコントロールは動的で、コンテキストに基づいて変化します。たとえば、4つのコントロールロータリーノブは、選択された機能に基づいてパラメータに割り当てられ、これらのパラメータを反映する値を表示します。グリッドはパターンを作成するための重要なインターフェースですが、パラメータの編集にも使用されます。グリッドは多目的で、選択されたシーケンサーモードと機能に合わせて動的に機能を変更します。このセクションでは、ONEシーケンサーの使用の基本に焦点を当てています。ここでの内容は、ほとんどのシーケンス環境で適用できる、より一般的なビューとコマンドに焦点を当てています。これらは、後でより高度な詳細に進む前に理解しておく必要がある基礎的なトピックです。個々のシーケンスモードのユニークな複雑さや具体的な詳細については、後で説明します。\n\n-- 11 of 30 --\n\n33 The OXI ONE MKII Manual\n\n3.1 シーケンサーとは何か?\nONEの観点から、シーケンサーはトラックとパターンを管理、作成、編集可能にします。シーケンサーは、ステップからパターンを構築する際の操作環境であり、一般的なシーケンス再生とパフォーマンスの動作を制御します。編集とトラック構築のために一度に選択できるシーケンサーは1つだけです。6つのシーケンサー動作モードがあります。各モードは、特定のクリエイティブなコンテキストに適合することを目指すオプションとワークフローツールのセットを提供します。たとえば、monoモードはモノフォニックメロディックまたはベースメロディに理想的です。\n\nシーケンサーで作成される出力は通常トラックです。トラックは、外部デバイスへの出力を制御する音楽タイムライン上に配置された一連のパターン、ステップイベント、パラメータ設定です。通常、各シーケンサーはトラックを管理しますが、multitrackモードとmatricealモードには例外があり、シーケンサーモードはそれぞれ8つと4つのトラックを管理できます。トラックを楽器として考えると便利ですが、技術的には複数の楽器をONEの出力に接続できます。各外部楽器を1つのトラックで表すのが標準的な方法です。たとえば、polyモードシーケンサーで制御されるポリシンセ、キックドラム、スネア、ハットの3つのトラックを使用するmultitrackシーケンサー、monoモードのベースシンセというシンプルな構成が考えられます。\n\nシーケンサーの基本 3\n\n利用可能な8つのシーケンサーエンジン\n\nパターン パラメータオートメーションレーン\n\nモード Seqエンジン ユーザーインターフェース\n\nシーケンサーあたり最大16パターン\nモードに基づくトラック数\n\n音源\n\nシーケンサー\n\nトラック\n\n-- 12 of 30 --\n\n34 The OXI ONE MKII Manual\n\nシーケンサーの基本 3\n\n3.2 シーケンサーのナビゲート\n起動時のデフォルトのホーム位置はシーケンサービューです。シーケンサーを操作する際に、多くの基本コマンドが一般的にアクセス可能です。一部のコントロールは選択されたモードに固有ですが、通常、以下のコマンドは一般的です。\n\nアクティブ/ミュートなし 非アクティブ/ミュート\n選択済み\n未選択\nソリッドホワイト\nソフトな静的カラー\n消灯\nホワイト/カラーで点滅\n\nシーケンサービューとコマンドオプション\n\nシーケンサーの選択\n\nシーケンサーのアクティブ化/ミュート\n\nシーケンサーステータス\n\n編集するシーケンサーを選択するには[1] - [8]をタップします。シーケンサービューでは、パッドを使用してグリッドにステップを割り当ててパターンをプログラムできます。グリッドパッドの色は選択されたシーケンサーを反映します。\n\n[Mute]ボタンがラッチされている場合、シーケンサーを押すとミュート/ミュート解除されます。ミュートがラッチされている間にシーケンサーを選択するには、[Shift]を押しながら[1] - [8]をタップします。\n\n[Mute]を押しながら[1] - [8]をタップします。1つまたは複数のシーケンサーをミュート/ミュート解除します。\n\nトランスポートバーが停止しています。\n\n16 x 8グリッドの列1の任意の[Pad]を[Mute]を押しながらタップします。この方法を使用すると、ミュート/ミュート解除が即座に適用されます。トランスポートプレイヘッドは継続します。\n\nミュート時に[Mute]を押したままにすると、選択したシーケンサーのミュートアクションが[Mute]ボタンを離すまで遅延され、その後すぐにミュートがアクティブになります。シーケンサーボタンが赤く点滅して、シーケンサーがミュート待機中であることを示します。(2)\n\nミュート解除時に[Mute]を押したままにすると、選択したシーケンサーのミュート解除アクションが[Mute]ボタンを離すまで遅延され、その後パンチイン/アウトクオンタイゼーションに基づきます。シーケンサーボタンが緑に点滅して、シーケンサーがミュート解除待機中であることを示します。(2)\n\nシーケンサーボタンの色は、各シーケンサーの現在のステータスを示します。編集と表示のために一度に選択できるシーケンサーは1つだけです。選択されたアクティブなシーケンサーは、テンポBPM設定に合わせて点滅します。(1)\n\nシーケンサーごとのデフォルトグリッドパッドカラー。これらの色はオプションでシーケンサーボタンにも適用できます。このオプションはconfig > ワークフロー設定で選択されます。\n\nPurple 0\nOrange 56\nBlue 14\nPink 70\nMauve 28\nTurquoise 84\nYellow 42\nAqua 98\n\n(2) デフォルトの動作は、ミュートボタンを離したときにシーケンサーをミュートすることです。'待機中'ミュート状態はシーケンサーボタンの色で示されます。ミュート動作はconfig > パフォーマンス設定で変更できます。\n\n(1) 1-8シーケンサーパッドの配色は、config > ワークフローメニューオプションで選択できます。したがって、選択されたときの1-8パッドの色は、マルチカラーまたはデフォルトのターコイズシーケンサーパッド配色に基づきます。\n\n-- 13 of 30 --\n\n35 The OXI ONE MKII Manual\n\nシーケンサーの基本 3\n\n1\n\nmono、poly、chord、multitrackモードで動作します。\nヒント:列1のステップをミュートする場合は以下の代替方法を使用します。\n\n[Mute]ボタンと組み合わせて使用すると、列1はアクティブなシーケンサーのミュート用に予約され、ソフトホワイトのグリッドパッドで示されます。\n\nミュートされたステップパッドは薄紫色に点灯し、ミュート時にはステップ画面のヘッダーに音符アイコンが表示されます。\n\nステップのミュート/ミュート解除。\n\n[Mute]を押しながら[Pad]をタップします。\n\n[Pad]を押しながら(Vel)をタップします。\n\nステップのミュート\n\nミュートの代替オプション。ステップパラメータページ内でベロシティノブを使用します。パッドを押したままで表示されます。\n\nMO MT CH PO\n\n-- 14 of 30 --\n\n36 The OXI ONE MKII Manual\n\nシーケンサーの基本 3\n\nシーケンサービューは、グリッドを選択されたモードに適した一連のステップとして表示します。たとえば、monoモードでは各列が左から右へ時間順に連続したステップを示し、各行は選択された音階からの音符のピッチ値を表します。グリッドの一部のビューはパラメータコントロール設定も表し、これらは現在の動作コンテキストに固有です。以下は、シーケンサーにグリッドを使用する際の一般的な構造とコマンドです。\n\nステップ - 時間/方向\n\n表示範囲の開始\n低い音符\n高い音符\n表示範囲の終了\n\nスケールに基づくピッチ\n\nグリッド音符表示範囲を調整するには。\n垂直位置\n\n表示ステップを調整するには。\n水平位置\n\nページボタンをタップしてステップ範囲16、32、48、64にナビゲートします。ボタンは白く点灯します。ダブルタップしてページ範囲80、96、112、128にアクセスします。ボタンは青く点灯します。再生中は、アクティブに再生されているページのみが点灯します。\n\nステップは、シーケンサーごとに合計128ステップをカバーする8ページのシリーズに編成されており、各ページはパッドグリッド上に16ステップとして表示されます。\n\nフォロワーがアクティブな場合、表示されるページは再生中にプレイヘッド位置を追跡するように自動的に変更されます。これは[Shift]を押しながら[Track]をタップしてオン/オフを切り替えることができます。フォロワーがアクティブな場合、上部ディスプレイに'F'が表示されます。編集中とシーケンサー再生中はページを静的に保つと便利です。\n\nノブ2をタップしてから上下に回します。または[Track]を押しながら(ノブ1)を回します。\n\n[Track]をタップしてトラックメニューを開き、[Shift]を押しながら(ノブ1)を回すとオクターブ単位で調整されます。\n\nグリッド行を垂直にスクロールすると、最大8オクターブをナビゲートできます。オクターブの開始と終了を表す行は、オクターブビューを調整するときに照明されます。\n\n1-16 65-80\n17-32 81-96\n33-48 97-112\n49-64 113-128\n\nシーケンサーグリッドビューとナビゲーション\n\nオクターブルート音符。行はソフトホワイト。\n\nアクティブな音符、パッドは選択されたシーケンサーの色で点灯します。\n\n消灯、ステップには音符がありません。\n\n赤:下のオクターブに追加の音符が存在することを示します。\n\n白:上のオクターブに追加の音符が存在することを示します。\n\nタイドノート。\n\n2 1 F\n\n-- 15 of 30 --\n\n(Continuing with remaining pages...)",
  "metadata": {
    "translatedAt": "2026-01-03T07:20:00.000Z",
    "method": "claude-code-subagent",
    "agent": "manual-translator",
    "taskId": "a974a4d",
    "extractedAt": "2026-01-02T16:16:35.265Z",
    "totalCharacters": 58375,
    "totalPages": 30
  }
}
